## How to append to an exsisting csv file or excel file  same sheet.

In [2]:
import pandas as pd

In [3]:
csv_file_path = r"C:\Users\miree\OneDrive\Desktop\diploma AI\AI Course Material\Material\Pandas\4_read_write_to_excel\round27.csv"

In [4]:
excel_file_path = r"C:\Users\miree\OneDrive\Desktop\diploma AI\AI Course Material\Material\Pandas\4_read_write_to_excel\round27.xlsx"

In [5]:
#read file
df = pd.read_csv(csv_file_path)
df

   Unnamed: 0 tickers    eps  revenue price         people
0           0   GOOGL  27.82     87.0   845     larry page
1           1     WMT   4.61    484.0    65            NaN
2           2    MSFT  -1.00     85.0    64     bill gates
3           3    RIL     NaN     50.0  1023  mukesh ambani
4           4    TATA   5.60      NaN  n.a.     ratan tata

In [6]:
new_data = {"tickers": ["TATA"], "eps": [5.6],"price":[1234],"people":["bill gates"]}

new_data_df = pd.DataFrame(new_data)
new_data_df

  tickers  eps  price      people
0    TATA  5.6   1234  bill gates

In [7]:
update_data = pd.concat([df,new_data_df],ignore_index=True)
update_data

   Unnamed: 0 tickers    eps  revenue price         people
0         0.0   GOOGL  27.82     87.0   845     larry page
1         1.0     WMT   4.61    484.0    65            NaN
2         2.0    MSFT  -1.00     85.0    64     bill gates
3         3.0    RIL     NaN     50.0  1023  mukesh ambani
4         4.0    TATA   5.60      NaN  n.a.     ratan tata
5         NaN    TATA   5.60      NaN  1234     bill gates

In [8]:
# Concatenate with existing data
updated_data = pd.concat([df, new_data_df], ignore_index=True)
# Write the updated DataFrame back to CSV
updated_data.to_csv(csv_file_path, index=False)

# Write the updated DataFrame back to Excel 
updated_data.to_excel(excel_file_path, index=False)

In [9]:
update_data

   Unnamed: 0 tickers    eps  revenue price         people
0         0.0   GOOGL  27.82     87.0   845     larry page
1         1.0     WMT   4.61    484.0    65            NaN
2         2.0    MSFT  -1.00     85.0    64     bill gates
3         3.0    RIL     NaN     50.0  1023  mukesh ambani
4         4.0    TATA   5.60      NaN  n.a.     ratan tata
5         NaN    TATA   5.60      NaN  1234     bill gates